#### Pandas is a powerful library in data science,where we can convert raw data to understandable information. It is built on top of numpy,and contains more functionalities than numpy. It is best tool for handling real world messy data.

* Pandas gives us 2 powerful data structures-series,dataframe. Internal alignment of data is a specific feature of this tool

In [1]:
import numpy as np
import pandas as pd

In [2]:
d=[40,20,60,80,12]
ser1=pd.Series(d)
print(ser1)
print(type(ser1))

0    40
1    20
2    60
3    80
4    12
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
###we can give our own indexes:
sales=[500,550,675,486,682]
days=['Monday','Tuesday','Wednesday','Thursday','Friday']

ser2=pd.Series(sales,index=days)
ser2

Monday       500
Tuesday      550
Wednesday    675
Thursday     486
Friday       682
dtype: int64

In [4]:
###Q) What are the sales recorded on thurday?

thurs_sales=ser2['Thursday']
print('Sales on Thursday:',thurs_sales)

Sales on Thursday: 486

In [5]:
sales2=np.array([500,550,675,486,682]) ###create a series from values stored in an array
ser3=pd.Series(sales2)
ser3

0    500
1    550
2    675
3    486
4    682
dtype: int32

In [6]:
###using data stored in a dictionaries:
d2={'Name':'Python','id':10875,3:'Three'}
ser4=pd.Series(d2)
ser4

Name    Python
id       10875
3        Three
dtype: object

In [7]:
###using data stored in a dictionaries:
d2={'Name':'Python','id':10875,3:'Three'}
ser5=pd.Series(d2,index=['a','id','c'])
ser5

a       NaN
id    10875
c       NaN
dtype: object

In [8]:
d3={'Name':['A','B','C','D'],
   'Experience':[1.2,2.8,5.5,3.5],
   'Salary':[40000,55000,96000,60000]}
df0=pd.DataFrame(d3)
df0

  Name  Experience  Salary
0    A         1.2   40000
1    B         2.8   55000
2    C         5.5   96000
3    D         3.5   60000

In [9]:
d3={'Name':['A','B','C','D'],
   'Experience':[1.2,2.8,5.5,3.5],
   'Salary':[40000,55000,96000,60000]}
df0=pd.DataFrame(d3,index=[1,2,3,4])
df0

  Name  Experience  Salary
1    A         1.2   40000
2    B         2.8   55000
3    C         5.5   96000
4    D         3.5   60000

In [10]:
df0.iloc[2,1] ###iloc=index location.

5.5

In [11]:
###iloc is a function which we use to slice dataframes using the index position of the value we want to retrieve.

In [12]:
####loc function is used to slice dataframes with the row,column names(labels)

In [13]:
df0.at[3,'Experience']  #to get a single value from the dataframe

5.5

In [14]:
df0.loc[3,'Experience']

5.5

In [15]:
df0

  Name  Experience  Salary
1    A         1.2   40000
2    B         2.8   55000
3    C         5.5   96000
4    D         3.5   60000

In [16]:
df0.loc[2:3]

  Name  Experience  Salary
2    B         2.8   55000
3    C         5.5   96000

In [17]:
df0.iloc[2:3]

  Name  Experience  Salary
3    C         5.5   96000

In [18]:
###get the value 55,000
df0.iloc[1,2]

55000

In [19]:
df0.loc[2,'Salary']

55000

#### Text data Operations:

In [20]:
df1=pd.DataFrame({'column':['Hello','World','Python','Data Science']})
df1

         column
0         Hello
1         World
2        Python
3  Data Science

In [21]:
###i want to find out the length of each string value mapped to 'column' and i will store the values in a 
### separate variable called length.
df1['Length']=df1['column'].str.len()
print('Length of each string value mapped to column is:')
print(df1)

Length of each string value mapped to column is:
         column  Length
0         Hello       5
1         World       5
2        Python       6
3  Data Science      12

In [22]:
## to convert each string value to uppercase or lowercase we use the upper() or lower() function:
df1['Upper']=df1['column'].str.upper()
df1

         column  Length         Upper
0         Hello       5         HELLO
1         World       5         WORLD
2        Python       6        PYTHON
3  Data Science      12  DATA SCIENCE

In [23]:
###iterating over rows:
df2=pd.DataFrame({'col1':[1,2,3],'col2':['A','B','C']})
df2

   col1 col2
0     1    A
1     2    B
2     3    C

In [24]:
for index,row in df2.iterrows():
    print(index,row)

0 col1    1
col2    A
Name: 0, dtype: object
1 col1    2
col2    B
Name: 1, dtype: object
2 col1    3
col2    C
Name: 2, dtype: object

In [25]:
###Q) change the row index from 0 to 10 and 2 to 25 in the dataframe df2?

In [26]:
### iterating over a 1D series:
series1=pd.Series([10,20,30],name='values')
series1

0    10
1    20
2    30
Name: values, dtype: int64

In [27]:
series2=pd.Series([10,20,30])
series2

0    10
1    20
2    30
dtype: int64

In [28]:
for index,value in series1.iteritems():
    print(f"index:{index},Value{value}")

index:0,Value10
index:1,Value20
index:2,Value30

C:\Users\Admin\AppData\Local\Temp\ipykernel_3384\2901372315.py:1: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for index,value in series1.iteritems():

In [29]:
for index in series2.items():
    print(index)

(0, 10)
(1, 20)
(2, 30)

In [30]:
###apply method is used to apply a function on a single row or column in a dataframe
df3=pd.DataFrame({'Old Column':[10,20,30]})
df3

   Old Column
0          10
1          20
2          30

In [31]:
df3['ModCol']=df3['Old Column'].apply(lambda x:x*x)
df3

   Old Column  ModCol
0          10     100
1          20     400
2          30     900

In [32]:
d4={'Name':pd.Series(['Tom','Jyoti','Maria','Bill']),
    'Language': pd.Series(['English','Japanese','French','Hindi']),
    'Marks':pd.Series([56,67,88,91])}

df4=pd.DataFrame(d4)

In [33]:
df4

    Name  Language  Marks
0    Tom   English     56
1  Jyoti  Japanese     67
2  Maria    French     88
3   Bill     Hindi     91

In [34]:
d4

{'Name': 0      Tom
 1    Jyoti
 2    Maria
 3     Bill
 dtype: object,
 'Language': 0     English
 1    Japanese
 2      French
 3       Hindi
 dtype: object,
 'Marks': 0    56
 1    67
 2    88
 3    91
 dtype: int64}

##### Sorting:

In [35]:
df5=pd.DataFrame({'Name':['Alice','Bob','Charlie'],
                  'Age':[25,22,30],
                  'Salary':[50000,60000,75000]})
df5

      Name  Age  Salary
0    Alice   25   50000
1      Bob   22   60000
2  Charlie   30   75000

In [36]:
df5_sorted=df5.sort_values(by='Age')
df5_sorted

      Name  Age  Salary
1      Bob   22   60000
0    Alice   25   50000
2  Charlie   30   75000

In [37]:
df5_multisort=df5.sort_values(by=['Age','Salary'],ascending=[True,False])
df5_multisort

      Name  Age  Salary
1      Bob   22   60000
0    Alice   25   50000
2  Charlie   30   75000

In [38]:
##sorting of row indexes:
sorted_indexes=df5_multisort.sort_index(ascending=0)
sorted_indexes

      Name  Age  Salary
2  Charlie   30   75000
1      Bob   22   60000
0    Alice   25   50000

In [39]:
df5_multisort = df5.sort_values(by = ['Age', 'Salary'], ascending = [True, False]).sort_index()
df5_multisort

      Name  Age  Salary
0    Alice   25   50000
1      Bob   22   60000
2  Charlie   30   75000

In [40]:
df7=pd.DataFrame({'Column_name':[5,10,8],
                 'column1':[10,20,30],
                 'column2':[100,200,300],
                 'Another_column':[25,35,45]})
df7

   Column_name  column1  column2  Another_column
0            5       10      100              25
1           10       20      200              35
2            8       30      300              45

In [41]:
#Q) access the column 'column_name' from df7

In [42]:
print(df7['Column_name'])

0     5
1    10
2     8
Name: Column_name, dtype: int64

In [43]:
df7.iloc[:,0]

0     5
1    10
2     8
Name: Column_name, dtype: int64

In [44]:
df7.Column_name

0     5
1    10
2     8
Name: Column_name, dtype: int64

In [45]:
#Q) access multiple columns 'column1' and 'column2' from df7

In [46]:
print(df7[['column1','column2']])

   column1  column2
0       10      100
1       20      200
2       30      300

In [47]:
df7.iloc[:,1:3]

   column1  column2
0       10      100
1       20      200
2       30      300

In [48]:
df7.loc[:,['column1','column2']]

   column1  column2
0       10      100
1       20      200
2       30      300

In [49]:
#Q) access the value 45 from df7

In [50]:
df7

   Column_name  column1  column2  Another_column
0            5       10      100              25
1           10       20      200              35
2            8       30      300              45

In [51]:
df7.iloc[2,3]

45

In [52]:
df7.loc[2,'Another_column']

45

In [53]:
#Q) access the value 35

In [54]:
df7

   Column_name  column1  column2  Another_column
0            5       10      100              25
1           10       20      200              35
2            8       30      300              45

In [55]:
df7.iloc[1,3]

35

In [56]:
df7.iat[1,3] ##iat and iloc are same,use either

35

In [57]:
df7.loc[1,'Another_column']

35

In [58]:
df7.at[1,'Another_column'] ## at and loc is same,use either

35

In [59]:
#Q)slice out all values greater than 10 of column1  and print out only Another_column and Column_name values
# which satisfy the condition

In [60]:
df7

   Column_name  column1  column2  Another_column
0            5       10      100              25
1           10       20      200              35
2            8       30      300              45

In [61]:
df7[df7['column1']>10] # i want a subset of only those rows from df7 which meet the conditions

   Column_name  column1  column2  Another_column
1           10       20      200              35
2            8       30      300              45

In [62]:
filtered_df=df7[df7['column1']>10][['Another_column','Column_name']]
filtered_df

   Another_column  Column_name
1              35           10
2              45            8

In [63]:
#Q)iterate over all rows in df4 and print the results

In [64]:
df4

    Name  Language  Marks
0    Tom   English     56
1  Jyoti  Japanese     67
2  Maria    French     88
3   Bill     Hindi     91

In [65]:
for i,j in df4.iterrows():
    print(i,j)
    print()

0 Name            Tom
Language    English
Marks            56
Name: 0, dtype: object

1 Name           Jyoti
Language    Japanese
Marks             67
Name: 1, dtype: object

2 Name         Maria
Language    French
Marks           88
Name: 2, dtype: object

3 Name         Bill
Language    Hindi
Marks          91
Name: 3, dtype: object

In [66]:
#Q)get the values associated with 'Maria' in df4

In [67]:
for index,value in df4.iterrows():
    if('Maria' in value['Name']):
        print(value)

Name         Maria
Language    French
Marks           88
Name: 2, dtype: object

In [68]:
print(df4[df4['Name'] == 'Maria'])

    Name Language  Marks
2  Maria   French     88

In [69]:
#Q) insert a new column called 'city' in df4 and assign values Delhi,Mumbai,Bengaluru,Kolkata to the variable.

In [70]:
df4['city']=['Delhi','Mumbai','Bengaluru','Kolkata']
df4

    Name  Language  Marks       city
0    Tom   English     56      Delhi
1  Jyoti  Japanese     67     Mumbai
2  Maria    French     88  Bengaluru
3   Bill     Hindi     91    Kolkata

In [71]:
#Q) iterate over the columns in df4

In [72]:
df4.columns  #gives you the list of all columns in the df

Index(['Name', 'Language', 'Marks', 'city'], dtype='object')

In [73]:
for col in df4.columns:
    print(df4[col].values)

['Tom' 'Jyoti' 'Maria' 'Bill']
['English' 'Japanese' 'French' 'Hindi']
[56 67 88 91]
['Delhi' 'Mumbai' 'Bengaluru' 'Kolkata']

In [74]:
for i, j in df4.items():
    print(i, j)

Name 0      Tom
1    Jyoti
2    Maria
3     Bill
Name: Name, dtype: object
Language 0     English
1    Japanese
2      French
3       Hindi
Name: Language, dtype: object
Marks 0    56
1    67
2    88
3    91
Name: Marks, dtype: int64
city 0        Delhi
1       Mumbai
2    Bengaluru
3      Kolkata
Name: city, dtype: object

### Functions of a dataframe:

* tail,head-selectively displays the bottom and top 5 rows of a dataframe.
* sample() functions helps select random rows and columns from a dataframe.
* info() function gives more info on the dataset
* describe() functions gives the summary stats for the variables in the data
* query() functions helps us to query the dataset on some condition
* loc() helps us to query the dataset based on column and row labels
* iloc() helps us to query the dataset based on the index position of rows and columns
* unique() helps us get the distinct values in a certain row or column
* null() helps us to locate missing values
* fillna() helps us to fill missing values in the dataset with some value
* rename() helps us to rename the column name
* where() replaces cells with null values where the where condition is not satisfied
* drop() used  to drop columns/rows from a dataset
* corr() used to find relationships between variables.

##### The loc() function is label based data selecting method which means that we have to pass the name of the row or column which we want to select.

#### The iloc() function is an indexed-based selecting method which means that we have to pass an integer index in the method to select a specific row/column.

In [75]:
data=pd.read_csv('Salary_Data.csv')

In [76]:
data.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [77]:
data.tail(10)

    YearsExperience    Salary
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [78]:
data.shape

(30, 2)

In [79]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     float64
dtypes: float64(2)
memory usage: 612.0 bytes

In [80]:
data.sample(15)

    YearsExperience    Salary
2               1.5   37731.0
15              4.9   67938.0
23              8.2  113812.0
17              5.3   83088.0
20              6.8   91738.0
13              4.1   57081.0
0               1.1   39343.0
10              3.9   63218.0
22              7.9  101302.0
25              9.0  105582.0
18              5.9   81363.0
24              8.7  109431.0
16              5.1   66029.0
1               1.3   46205.0
26              9.5  116969.0

In [81]:
data.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [82]:
data.query('YearsExperience>5.7')

    YearsExperience    Salary
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [83]:
data.loc[data['YearsExperience']>5.7]

    YearsExperience    Salary
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [84]:
data.isna().sum()

YearsExperience    0
Salary             0
dtype: int64

In [85]:
df10=pd.DataFrame({'Column_name':[5,10,8,10],
                 'column1':[10,20,30,40],
                 'column2':[100,200,300,np.nan],
                 'Another_column':[25,35,45,np.nan],
                  'group':['A','B','A','a']})
df10

   Column_name  column1  column2  Another_column group
0            5       10    100.0            25.0     A
1           10       20    200.0            35.0     B
2            8       30    300.0            45.0     A
3           10       40      NaN             NaN     a

In [86]:
###check the datatypes each variable stores
### go for missing value check,using isna(),as well as the describe function.

In [87]:
df10.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Column_name     4 non-null      int64
 1   column1         4 non-null      int64
 2   column2         3 non-null      float64
 3   Another_column  3 non-null      float64
 4   group           4 non-null      object
dtypes: float64(2), int64(2), object(1)
memory usage: 292.0+ bytes

In [88]:
df10.dtypes

Column_name         int64
column1             int64
column2           float64
Another_column    float64
group              object
dtype: object

In [89]:
df10.isnull().sum(axis=0)

Column_name       0
column1           0
column2           1
Another_column    1
group             0
dtype: int64

In [90]:
df10['group'].unique() ##applies to catrgorical variables

array(['A', 'B', 'a'], dtype=object)

In [91]:
df10['column2'].fillna(df10['column2'].mean(),inplace=True)

In [92]:
df10['Another_column'].fillna(df10['Another_column'].mean(),inplace=True)

In [93]:
df10

   Column_name  column1  column2  Another_column group
0            5       10    100.0            25.0     A
1           10       20    200.0            35.0     B
2            8       30    300.0            45.0     A
3           10       40    200.0            35.0     a

In [94]:
df10.rename(columns={'Column_name':'colA','column1':'colB','column2':'colC','Another_column':'colD'},inplace=True)

In [95]:
df10

   colA  colB   colC  colD group
0     5    10  100.0  25.0     A
1    10    20  200.0  35.0     B
2     8    30  300.0  45.0     A
3    10    40  200.0  35.0     a

In [96]:
df10.drop('colD',axis=1,inplace=True) #axis=1 implies columns,and axis=0 implies rows

In [97]:
df10

   colA  colB   colC group
0     5    10  100.0     A
1    10    20  200.0     B
2     8    30  300.0     A
3    10    40  200.0     a

In [98]:
#dropping the third row:
df10.drop(2,inplace=True,axis=0)

In [99]:
df10

   colA  colB   colC group
0     5    10  100.0     A
1    10    20  200.0     B
3    10    40  200.0     a

In [100]:
data.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [101]:
#correlation strength lies between 0 and 1
data.corr()

                 YearsExperience    Salary
YearsExperience         1.000000  0.978242
Salary                  0.978242  1.000000

In [102]:
### The correlation function gives us the direction(either positive or negetive) and the relationship strength between
### a pair of variables.

In [104]:
cond1=data['YearsExperience']>5.7
cond2=data['Salary']>50000
data.where(cond1 & cond2,inplace=True)
data    ##we get missing values wherever the condition is not met.

    YearsExperience    Salary
0               NaN       NaN
1               NaN       NaN
2               NaN       NaN
3               NaN       NaN
4               NaN       NaN
5               NaN       NaN
6               NaN       NaN
7               NaN       NaN
8               NaN       NaN
9               NaN       NaN
10              NaN       NaN
11              NaN       NaN
12              NaN       NaN
13              NaN       NaN
14              NaN       NaN
15              NaN       NaN
16              NaN       NaN
17              NaN       NaN
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0